# CLI tools (official repos)
7zip
chezmoi
curl
direnv
docker
docker-buildx
docker-compose
fzf
git
htop
jq
just
lazygit
neovim
ripgrep
shfmt
starship
tailscale
tree
wget

# CLI tools (AUR)
bitwarden-cli
jless
just-lsp

# GUI apps (official repos)
audacity
bitwarden
firefox
signal-desktop
transmission-gtk
vlc

# GUI apps (AUR)
ghostty
google-chrome
jetbrains-toolbox
mullvad-vpn
obsidian
vscodium
zen-browser
zoom
