###############################################################################
# SYSTEM
###############################################################################

tap "domt4/autoupdate"

brew "7zip"
brew "chezmoi"
brew "curl"
brew "fzf"
brew "git"
brew "htop"
brew "jless"
brew "jq"
brew "pinentry-mac"
brew "rbw"
brew "ripgrep"
brew "starship"
brew "tree"
brew "wget"
brew "zsh-syntax-highlighting"

###############################################################################
# DEVELOPMENT
###############################################################################

brew "age"
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "lazygit"
brew "mise"
brew "neovim"
brew "shfmt"
brew "sops"

cask "vscodium"

# Ruby
brew "gmp"
brew "libyaml"

vscode "Anthropic.claude-code"
vscode "DavidAnson.vscode-markdownlint"
vscode "editorconfig.editorconfig"
vscode "hverlin.mise-vscode"
vscode "mkhl.shfmt"
vscode "mousavian.ssh-config-syntax-highlighter"
vscode "k--kato.intellij-idea-keybindings"
vscode "redhat.vscode-yaml"
vscode "Shopify.ruby-lsp"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"

###############################################################################
# DESKTOP
###############################################################################

brew "tailscale"

cask "alfred"
cask "audacity"
cask "bitwarden"
cask "claude"
cask "claude-code"
cask "firefox"
cask "ghostty"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "monodraw"
cask "mullvad-vpn"
cask "obsidian"
cask "rectangle"
cask "scroll-reverser"
cask "shottr"
cask "signal"
cask "transmission"
cask "ungoogled-chromium"
cask "vlc"
cask "zen"
cask "zoom"
