tap "domt4/autoupdate"

brew "tailscale"

cask "alfred"
cask "audacity"
cask "bitwarden"
cask "claude"
cask "claude-code"
cask "firefox"
cask "ghostty"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "monodraw"
cask "mullvad-vpn"
cask "obsidian"
cask "scroll-reverser"
cask "shottr"
cask "signal"
cask "transmission"
cask "vlc"
cask "zen"
cask "zoom"
