tap "domt4/autoupdate"

brew "7zip"
brew "chezmoi"
brew "curl"
brew "fzf"
brew "git"
brew "htop"
brew "jless"
brew "jq"
brew "just"
brew "pinentry-mac"
brew "ripgrep"
brew "shfmt"
brew "starship"
brew "tree"
brew "wget"
brew "zsh-syntax-highlighting"
