tap "domt4/autoupdate"

brew "7zip"
brew "chezmoi"
brew "colima"
brew "curl"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "fzf"
brew "git"
brew "htop"
brew "jless"
brew "jq"
brew "just"
brew "just-lsp"
brew "lazygit"
brew "neovim"
brew "ripgrep"
brew "shfmt"
brew "starship"
brew "tree"
brew "wget"

cask "rectangle"
cask "vscodium"
