brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "lazygit"
brew "mise"
brew "neovim"

# Ruby
brew "gmp"
brew "libyaml"

vscode "Anthropic.claude-code"
vscode "DavidAnson.vscode-markdownlint"
vscode "editorconfig.editorconfig"
vscode "hverlin.mise-vscode"
vscode "mkhl.shfmt"
vscode "k--kato.intellij-idea-keybindings"
vscode "redhat.vscode-yaml"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
